#
# https://github.com/Homebrew/homebrew-bundle
#

# brew tap 'Homebrew/bundle'
# brew bundle
# fantastical 2
# solarized: curl -o http://ethanschoonover.com/solarized/files/solarized.zip
# aerial: https://github.com/JohnCoates/Aerial
# Powerline Meslo font: git clone https://github.com/powerline/fonts.git && cd fonts && ./install.sh

tap 'homebrew/cask'
tap 'homebrew/core'
# tap 'homebrew/fonts'

# FONTS
# cask 'font-inconsolata'
# cask 'font-anonymous-pro'
# cask 'font-dejavu-sans-mono-for-powerline'
# cask 'font-droid-sans'
# cask 'font-droid-sans-mono'
# cask 'font-droid-sans-mono-for-powerline'
# cask 'font-meslo-lg'
# cask 'font-input'
# cask 'font-inconsolata'
# cask 'font-inconsolata-for-powerline'
# cask 'font-meslo-lg'
# cask 'font-nixie-one'
# cask 'font-office-code-pro'
# cask 'font-pt-mono'
# cask 'font-raleway'
# cask 'font-roboto'
# cask 'font-source-code-pro'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-sans-pro'
# cask 'font-ubuntu'
# cask 'font-ubuntu-mono-powerline'


# cask 'google-chrome' # already installed
# cask 'google-drive'  # already installed
cask '1password'
cask 'aerial'
cask 'adobe-acrobat-reader'
cask 'alfred'
# cask 'amazon-drive'  # takes up a lot of disk if syncing
cask 'brave-browser'
cask 'caffeine'
cask 'charles'
# cask 'chrome-devtools'
# cask 'chefdk'  # replace with chef-workstation ?
cask 'coconutbattery'
cask 'docker'
cask 'dosbox'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'gimp'
# cask 'github-desktop'
cask 'google-chrome'
# cask 'google-earth-pro'
# cask 'google-hangouts'
cask 'istat-menus'
cask 'iterm2'
cask 'little-snitch'
cask 'micro-snitch'
# cask 'mactex'
# cask 'metasploit' # https://osx.metasploit.com/metasploitframework-latest.pkg
cask 'microsoft-office'
# cask 'soundflower'
cask 'slack'
# cask 'sublime-text'
cask 'switchresx'
cask 'tor-browser'
cask 'transmit'
cask 'tunnelbear'
# cask 'virtualbox'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

brew 'adwaita-icon-theme' # needed for ettercap to show icons
brew 'aircrack-ng'
brew 'arp-scan'
brew 'autoenv'
brew 'arp-sk'
brew 'arping'
brew 'bash'
brew 'bash-completion'
brew 'bazel'
brew 'bettercap'
brew 'bfg'
brew 'bluetoothconnector'
brew 'claws'
brew 'cmake'  # for vim youcompleteme plugin
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'dive'
brew 'datamash'
# brew 'elasticsearch' # brew services start elasticsearch to start now and restart at login
brew 'entr'
brew 'exiftool'
brew 'figlet'
brew 'fortune'
brew 'freetds'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'go'
brew 'gnupg2'
brew 'gpg'
# brew 'gpg-agent'  # doesnt exist anymore
brew 'graphviz'
brew 'handbrake'
# brew 'heroku'     # doesnt exist anymore
brew 'htop-osx'
brew 'httpie'
brew 'inetutils'
brew 'intel-power-gadget'  # Used with istat-menus
brew 'iperf3'
brew 'java'
brew 'jq'
brew 'kafkacat'
brew 'kube-ps1'
brew 'kubectx'
# brew 'kibana'  # brew services start kibana
brew 'lftp'
brew 'libev'
brew 'libmicrohttpd' # for kismet
brew 'librtlsdr' # for kismet
brew 'librdkafka'
brew 'lunchy-go'
brew 'openssl'
brew 'macfuse'
brew 'mas'
brew 'maven'
brew 'mediainfo'
brew 'mitmproxy'
brew 'mono'  # for vim youcompleteme plugin
brew 'mosh'
brew 'mtr'
brew 'mycli'
# brew 'mysql', restart_service: true
brew 'namebench'
brew 'ncftp'
brew 'ncurses'
brew 'nghttp2'
brew 'nmap'
brew 'node'
# brew 'ntopng'
brew 'p0f'
# brew 'phantomjs'
brew 'protobuf-c' # for kismet
brew 'pv'
# brew 'pyenv'
# brew 'pyenv-virtualenv'
# brew 'homebrew/boneyard/pyenv-pip-rehash'
brew 'r'
brew 'rclone'
brew 'ruby'
# brew install hudochenkov/sshpass/sshpass
brew 'slackcat'
brew 'socat'
brew 'sloccount'
brew 'suricata'
brew 'the_silver_searcher'
brew 'telnet'
brew 'tmate'
# brew 'tnftp'
# brew 'tnftpd'
brew 'tor'
brew 'tmux'
brew 'tpp'
brew 'tree'
brew 'uv'
# brew 'unrar'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'yq'

# brew 'curl', args:['with-nghttp2']

mas 'Microsoft-365', id: 1450038993
# mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
# mas 'Xcode', id: 497799835
mas 'Docs for Xcode', id: 688199928
# mas 'Wunderlist', id: 410628904

# MSSQL: https://docs.microsoft.com/en-us/sql/linux/sql-server-linux-setup-tools#macos
# tap 'microsoft/mssql-preview https://github.com/Microsoft/homebrew-mssql-preview'
# brew 'mssql-tools'
