# brew tap 'Homebrew/bundle'
# brew bundle
# fantastical 2
# solarized: curl -o http://ethanschoonover.com/solarized/files/solarized.zip
# aerial: https://github.com/JohnCoates/Aerial
# Powerline Meslo font: git clone https://github.com/powerline/fonts.git && cd fonts && ./install.sh

tap 'caskroom/cask'
tap 'homebrew/core'
tap 'homebrew/science'
#tap 'homebrew/fonts'

# FONTS
#cask 'font-inconsolata'
#cask 'font-anonymous-pro'
#cask 'font-dejavu-sans-mono-for-powerline'
#cask 'font-droid-sans'
#cask 'font-droid-sans-mono'
#cask 'font-droid-sans-mono-for-powerline'
#cask 'font-meslo-lg'
#cask 'font-input'
#cask 'font-inconsolata'
#cask 'font-inconsolata-for-powerline'
#cask 'font-meslo-lg'
#cask 'font-nixie-one'
#cask 'font-office-code-pro'
#cask 'font-pt-mono'
#cask 'font-raleway'
#cask 'font-roboto'
#cask 'font-source-code-pro'
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-sans-pro'
#cask 'font-ubuntu'
#cask 'font-ubuntu-mono-powerline'


# cask 'google-chrome' # already installed
# cask 'google-drive'  # already installed
cask '1password'
cask 'aerial'
cask 'adobe-acrobat'
cask 'alfred'
cask 'amazon-drive'
cask 'caffeine'
cask 'charles'
cask 'chrome-devtools'
cask 'chefdk'
cask 'coconutbattery'
cask 'dosbox'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gimp'
# cask 'github-desktop'
cask 'google-earth'
cask 'google-hangouts'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kite'
cask 'little-snitch'
cask 'lunchy'
cask 'mactex'
cask 'metasploit'
# cask 'slack'
cask 'sublime-text'
cask 'torbrowser'
cask 'transmit'
cask 'tunnelbear'
cask 'virtualbox'
cask 'vagrant'
cask 'wireshark'
cask 'xquartz'

brew 'adwaita-icon-theme' # needed for ettercap to show icons
brew 'aircrack-ng'
brew 'arp-scan'
brew 'autoenv'
brew 'arp-sk'
brew 'arping'
brew 'bash'
brew 'bash-completion'
brew 'bazel'
brew 'bfg'
brew 'coreutils'
brew 'cowsay'
brew 'datamash'
# brew 'elasticsearch' # brew services start elasticsearch to start now and restart at login
brew 'entr'
brew 'ettercap'
brew 'exiftool'
brew 'figlet'
brew 'fortune'
brew 'freetds'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'go'
brew 'gnupg2'
brew 'gpg'
brew 'gpg-agent'
brew 'handbrake'
brew 'heroku'
brew 'htop-osx'
brew 'httpie'
brew 'iperf3'
brew 'jq'
brew 'kafkacat'
# brew 'kibana'  # brew services start kibana
brew 'lftp'
brew 'libev'
brew 'libmicrohttpd' # for kismet
brew 'librtlsdr' # for kismet
brew 'librdkafka'
brew 'openssl'
brew 'mas'
brew 'maven'
brew 'mediainfo'
brew 'mitmproxy'
brew 'mobile-shell'
brew 'mtr'
brew 'mycli'
# brew 'mysql', restart_service: true
brew 'namebench'
brew 'ncftp'
brew 'ncurses'
brew 'nghttp2'
brew 'node'
brew 'ntopng'
brew 'p0f'
brew 'phantomjs'
brew 'protobufc' # for kismet
brew 'pv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'homebrew/boneyard/pyenv-pip-rehash'
brew 'r'
brew 'ruby'
brew 'socat'
brew 'sloccount'
brew 'suricata'
brew 'the_silver_searcher'
brew 'telnet'
brew 'tmate'
brew 'tnftp'
brew 'tnftpd'
brew 'tor'
brew 'tmux'
brew 'tpp'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

brew 'curl', args:['with-nghttp2']

mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
mas 'Docs for Xcode', id: 688199928
mas 'Wunderlist', id: 410628904

# MSSQL: https://docs.microsoft.com/en-us/sql/linux/sql-server-linux-setup-tools#macos
# tap 'microsoft/mssql-preview https://github.com/Microsoft/homebrew-mssql-preview'
# brew 'mssql-tools'
