#
# INSTRUCTIONS:
# brew bundle
# solarized: curl -o http://ethanschoonover.com/solarized/files/solarized.zip
# aerial: https://github.com/JohnCoates/Aerial
#

# TAPS
tap 'homebrew/bundle'
tap 'kismetwireless/kismet'
# https://www.nerdfonts.com/font-downloads
# tap 'ryanoasis/nerd-fonts'

# FONTS
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-input'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-pt-mono'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu'

# CASKS
cask '1password'
cask '1password-cli'
cask 'adobe-acrobat-reader'
# cask 'aerial'
# cask 'alfred'
# cask 'amazon-drive'  # takes up a lot of disk if syncing
# cask 'brave-browser'
# cask 'caffeine'
# cask 'charles'
# cask 'chrome-devtools'
# cask 'coconutbattery'
cask 'cleanshot'
cask 'cursor'
cask 'discord'
# cask 'docker'
# cask 'dosbox'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
# cask 'flux-app'
# cask 'gimp'
cask 'google-chrome'
# cask 'google-drive'
# cask 'istat-menus'
cask 'iterm2'
cask 'little-snitch'
cask 'micro-snitch'
# cask 'mactex'
cask 'metasploit' # https://osx.metasploit.com/metasploitframework-latest.pkg
# cask 'microsoft-office'
cask 'nordvpn'
cask 'ollama-app'
# cask 'soundflower'
# cask 'slack'
cask 'switchresx'
# cask 'tor-browser'
# cask 'transmit'
# cask 'tunnelbear'
cask 'wireshark-app'
cask 'xquartz'
cask 'zoom'

# PACKAGES
brew 'adwaita-icon-theme' # needed for ettercap to show icons
brew 'aircrack-ng'
brew 'arp-scan'
brew 'autoenv'
brew 'arp-sk'
brew 'arping'
brew 'bash'
brew 'bash-completion'
# brew 'bazel'
brew 'bettercap'
# brew 'bfg'
brew 'bluetoothconnector'
# brew 'claws'
brew 'cmake'  # for vim youcompleteme plugin
brew 'coreutils'
# brew 'cowsay'
brew 'curl'
# brew 'curl', args:['with-nghttp2']
brew 'dive'
brew 'datamash'
# brew 'elasticsearch' # brew services start elasticsearch to start now and restart at login
brew 'entr'
brew 'exiftool'
brew 'figlet'
brew 'fortune'
brew 'freetds'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-quick-stats'
brew 'go'
brew 'gnupg2'
brew 'gollama'
brew 'gpg'
brew 'graphviz'
brew 'handbrake'
brew 'htop-osx'
brew 'httpie'
brew 'inetutils'
# brew 'intel-power-gadget'  # Used with istat-menus
brew 'iperf3'
brew 'java'
brew 'jq'
# brew 'kafkacat'
brew 'kismet'
brew 'kube-ps1'
brew 'kubectx'
# brew 'kibana'  # brew services start kibana
brew 'lftp'
brew 'libev'
brew 'libmicrohttpd' # for kismet
brew 'librtlsdr' # for kismet
brew 'librdkafka'
brew 'llm'
brew 'lunchy-go'
brew 'openssl'
# brew 'macfuse'
brew 'mas'
# brew 'maven'
brew 'mediainfo'
brew 'mitmproxy'
brew 'mono'  # for vim youcompleteme plugin
brew 'mosh'
brew 'mtr'
brew 'mycli'
# brew 'mysql', restart_service: true
brew 'namebench'
brew 'ncftp'
brew 'ncurses'
brew 'nghttp2'
brew 'nmap'
brew 'node'
# brew 'ntopng'
brew 'ollama'
brew 'p0f'
brew 'pgcli'
brew 'poppler'  # for pdftotext
# brew 'phantomjs'
brew 'protobuf-c' # for kismet
brew 'pv'
brew 'python@3.12'
brew 'python@3.13'
brew 'qpdf'
brew 'r'
brew 'rclone'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
# brew install hudochenkov/sshpass/sshpass
brew 'slackcat'
brew 'slides'
brew 'sloccount'
brew 'socat'
brew 'speedtest-cli'
brew 'suricata'
# brew 'the_silver_searcher'
# brew 'telnet'
brew 'tmate'
# brew 'tnftp'
# brew 'tnftpd'
brew 'tor'
brew 'tmux'
# brew 'tpp' # git clone git@github.com:cbbrowne/tpp.git && cd tpp && make install
brew 'tree'
brew 'uv'
# brew 'unrar'
brew 'vim'
brew 'wget'
brew 'x264'
brew 'x265'
# brew 'youtube-dl'
brew 'yq'


# mas 'Microsoft-365', id: 1450038993
mas 'Slack', id: 803453959
# mas 'Xcode', id: 497799835
mas 'Docs for Xcode', id: 688199928
# mas 'Wunderlist', id: 410628904

# MSSQL: https://docs.microsoft.com/en-us/sql/linux/sql-server-linux-setup-tools#macos
# tap 'microsoft/mssql-preview https://github.com/Microsoft/homebrew-mssql-preview'
# brew 'mssql-tools'
